payloads/hey-caching-testing-results.log

Summary:
  Total:	120.0009 secs
  Slowest:	0.6812 secs
  Fastest:	0.0006 secs
  Average:	0.0033 secs
  Requests/sec:	2995.4441
  

Response time histogram:
  0.001 [1]	|
  0.069 [359383]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.137 [62]	|
  0.205 [0]	|
  0.273 [0]	|
  0.341 [0]	|
  0.409 [0]	|
  0.477 [0]	|
  0.545 [0]	|
  0.613 [0]	|
  0.681 [10]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0014 secs
  50% in 0.0017 secs
  75% in 0.0021 secs
  90% in 0.0031 secs
  95% in 0.0059 secs
  99% in 0.0423 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.6812 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0032 secs, 0.0005 secs, 0.6749 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0422 secs

Status code distribution:
  [200]	359456 responses



----------------------------------------