payloads/hey-results.log

Summary:
  Total:	120.5256 secs
  Slowest:	4.0836 secs
  Fastest:	0.0725 secs
  Average:	0.5082 secs
  Requests/sec:	19.6307
  

Response time histogram:
  0.073 [1]	|
  0.474 [1472]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.875 [385]	|■■■■■■■■■■
  1.276 [396]	|■■■■■■■■■■■
  1.677 [44]	|■
  2.078 [22]	|■
  2.479 [21]	|■
  2.880 [12]	|
  3.281 [4]	|
  3.682 [5]	|
  4.084 [4]	|


Latency distribution:
  10% in 0.1068 secs
  25% in 0.1398 secs
  50% in 0.3411 secs
  75% in 0.7303 secs
  90% in 1.1039 secs
  95% in 1.2632 secs
  99% in 2.5285 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0725 secs, 4.0836 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.5077 secs, 0.0716 secs, 4.0819 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0085 secs

Status code distribution:
  [200]	2120 responses
  [500]	246 responses



----------------------------------------

Summary:
  Total:	122.7045 secs
  Slowest:	4.0319 secs
  Fastest:	0.0805 secs
  Average:	0.5485 secs
  Requests/sec:	17.9537
  

Response time histogram:
  0.080 [1]	|
  0.476 [1275]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.871 [349]	|■■■■■■■■■■■
  1.266 [451]	|■■■■■■■■■■■■■■
  1.661 [77]	|■■
  2.056 [27]	|■
  2.451 [11]	|
  2.846 [4]	|
  3.242 [5]	|
  3.637 [0]	|
  4.032 [3]	|


Latency distribution:
  10% in 0.1156 secs
  25% in 0.1549 secs
  50% in 0.3816 secs
  75% in 0.9078 secs
  90% in 1.1526 secs
  95% in 1.3177 secs
  99% in 2.0649 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0805 secs, 4.0319 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.5481 secs, 0.0803 secs, 4.0311 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0045 secs

Status code distribution:
  [200]	1907 responses
  [500]	296 responses



----------------------------------------

Summary:
  Total:	120.8016 secs
  Slowest:	7.8813 secs
  Fastest:	0.0808 secs
  Average:	0.5603 secs
  Requests/sec:	17.7729
  

Response time histogram:
  0.081 [1]	|
  0.861 [1655]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.641 [408]	|■■■■■■■■■■
  2.421 [24]	|■
  3.201 [23]	|■
  3.981 [11]	|
  4.761 [14]	|
  5.541 [7]	|
  6.321 [2]	|
  7.101 [1]	|
  7.881 [1]	|


Latency distribution:
  10% in 0.1085 secs
  25% in 0.1447 secs
  50% in 0.3540 secs
  75% in 0.7618 secs
  90% in 1.1147 secs
  95% in 1.2611 secs
  99% in 4.0480 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0808 secs, 7.8813 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.5598 secs, 0.0805 secs, 7.8805 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [200]	1920 responses
  [500]	227 responses



----------------------------------------

Summary:
  Total:	122.5249 secs
  Slowest:	6.5032 secs
  Fastest:	0.0714 secs
  Average:	0.4222 secs
  Requests/sec:	22.9259
  

Response time histogram:
  0.071 [1]	|
  0.715 [2272]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.358 [514]	|■■■■■■■■■
  2.001 [11]	|
  2.644 [0]	|
  3.287 [0]	|
  3.930 [0]	|
  4.574 [0]	|
  5.217 [0]	|
  5.860 [6]	|
  6.503 [4]	|


Latency distribution:
  10% in 0.1000 secs
  25% in 0.1310 secs
  50% in 0.3029 secs
  75% in 0.5997 secs
  90% in 0.9897 secs
  95% in 1.0801 secs
  99% in 1.2858 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0714 secs, 6.5032 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.4217 secs, 0.0688 secs, 6.5025 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0095 secs

Status code distribution:
  [200]	2562 responses
  [500]	246 responses

Error distribution:
  [1]	Post "http://localhost:5237/checkin/v1/journeys/retrieve": context deadline exceeded (Client.Timeout exceeded while awaiting headers)

----------------------------------------

Summary:
  Total:	121.0995 secs
  Slowest:	3.2487 secs
  Fastest:	0.0796 secs
  Average:	0.5659 secs
  Requests/sec:	17.5806
  

Response time histogram:
  0.080 [1]	|
  0.397 [1061]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.713 [448]	|■■■■■■■■■■■■■■■■■
  1.030 [281]	|■■■■■■■■■■■
  1.347 [177]	|■■■■■■■
  1.664 [73]	|■■■
  1.981 [50]	|■■
  2.298 [22]	|■
  2.615 [7]	|
  2.932 [7]	|
  3.249 [2]	|


Latency distribution:
  10% in 0.1168 secs
  25% in 0.1764 secs
  50% in 0.3970 secs
  75% in 0.8169 secs
  90% in 1.2242 secs
  95% in 1.6004 secs
  99% in 2.2832 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0796 secs, 3.2487 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0035 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.5650 secs, 0.0793 secs, 3.2469 secs
  resp read:	0.0008 secs, 0.0000 secs, 0.0106 secs

Status code distribution:
  [200]	1951 responses
  [500]	178 responses



----------------------------------------

Summary:
  Total:	120.7909 secs
  Slowest:	2.9747 secs
  Fastest:	0.0691 secs
  Average:	0.4037 secs
  Requests/sec:	24.6873
  

Response time histogram:
  0.069 [1]	|
  0.360 [1851]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.650 [494]	|■■■■■■■■■■■
  0.941 [275]	|■■■■■■
  1.231 [300]	|■■■■■■
  1.522 [38]	|■
  1.812 [13]	|
  2.103 [3]	|
  2.394 [3]	|
  2.684 [2]	|
  2.975 [2]	|


Latency distribution:
  10% in 0.0943 secs
  25% in 0.1169 secs
  50% in 0.2878 secs
  75% in 0.5988 secs
  90% in 0.9808 secs
  95% in 1.0942 secs
  99% in 1.4787 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0691 secs, 2.9747 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:	0.4032 secs, 0.0688 secs, 2.9727 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0119 secs

Status code distribution:
  [200]	2728 responses
  [500]	254 responses



----------------------------------------

Summary:
  Total:	120.9360 secs
  Slowest:	2.8306 secs
  Fastest:	0.0747 secs
  Average:	0.4351 secs
  Requests/sec:	22.8799
  

Response time histogram:
  0.075 [1]	|
  0.350 [1508]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.626 [525]	|■■■■■■■■■■■■■■
  0.901 [254]	|■■■■■■■
  1.177 [410]	|■■■■■■■■■■■
  1.453 [56]	|■
  1.728 [6]	|
  2.004 [2]	|
  2.279 [1]	|
  2.555 [0]	|
  2.831 [4]	|


Latency distribution:
  10% in 0.1032 secs
  25% in 0.1376 secs
  50% in 0.3235 secs
  75% in 0.6553 secs
  90% in 1.0196 secs
  95% in 1.1077 secs
  99% in 1.2682 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0747 secs, 2.8306 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0033 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.4346 secs, 0.0743 secs, 2.8303 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0086 secs

Status code distribution:
  [200]	2497 responses
  [500]	270 responses



----------------------------------------

Summary:
  Total:	120.6760 secs
  Slowest:	1.4996 secs
  Fastest:	0.0709 secs
  Average:	0.3932 secs
  Requests/sec:	25.3406
  

Response time histogram:
  0.071 [1]	|
  0.214 [1401]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.357 [421]	|■■■■■■■■■■■■
  0.500 [358]	|■■■■■■■■■■
  0.642 [226]	|■■■■■■
  0.785 [175]	|■■■■■
  0.928 [78]	|■■
  1.071 [237]	|■■■■■■■
  1.214 [116]	|■■■
  1.357 [40]	|■
  1.500 [5]	|


Latency distribution:
  10% in 0.1015 secs
  25% in 0.1263 secs
  50% in 0.2980 secs
  75% in 0.5937 secs
  90% in 0.9841 secs
  95% in 1.0780 secs
  99% in 1.2534 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0709 secs, 1.4996 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0021 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.3927 secs, 0.0705 secs, 1.4995 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200]	2842 responses
  [500]	216 responses



----------------------------------------

Summary:
  Total:	120.3797 secs
  Slowest:	2.5932 secs
  Fastest:	0.0669 secs
  Average:	0.3414 secs
  Requests/sec:	29.2325
  

Response time histogram:
  0.067 [1]	|
  0.320 [2263]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.572 [504]	|■■■■■■■■■
  0.825 [288]	|■■■■■
  1.077 [368]	|■■■■■■■
  1.330 [69]	|■
  1.583 [16]	|
  1.835 [5]	|
  2.088 [2]	|
  2.341 [2]	|
  2.593 [1]	|


Latency distribution:
  10% in 0.0870 secs
  25% in 0.1027 secs
  50% in 0.1811 secs
  75% in 0.5212 secs
  90% in 0.9130 secs
  95% in 0.9978 secs
  99% in 1.2730 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0669 secs, 2.5932 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.3409 secs, 0.0668 secs, 2.5915 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0108 secs

Status code distribution:
  [200]	3285 responses
  [500]	234 responses



----------------------------------------

Summary:
  Total:	121.1328 secs
  Slowest:	1.6015 secs
  Fastest:	0.0812 secs
  Average:	0.4981 secs
  Requests/sec:	19.9616
  

Response time histogram:
  0.081 [1]	|
  0.233 [950]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.385 [312]	|■■■■■■■■■■■■■
  0.537 [289]	|■■■■■■■■■■■■
  0.689 [173]	|■■■■■■■
  0.841 [138]	|■■■■■■
  0.993 [102]	|■■■■
  1.145 [249]	|■■■■■■■■■■
  1.297 [141]	|■■■■■■
  1.449 [55]	|■■
  1.601 [8]	|


Latency distribution:
  10% in 0.1242 secs
  25% in 0.1664 secs
  50% in 0.3686 secs
  75% in 0.7727 secs
  90% in 1.1214 secs
  95% in 1.2230 secs
  99% in 1.3852 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0812 secs, 1.6015 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.4977 secs, 0.0810 secs, 1.6005 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0046 secs

Status code distribution:
  [200]	2096 responses
  [500]	322 responses



----------------------------------------

Summary:
  Total:	120.5100 secs
  Slowest:	1.3426 secs
  Fastest:	0.0714 secs
  Average:	0.4483 secs
  Requests/sec:	22.2554
  

Response time histogram:
  0.071 [1]	|
  0.199 [1024]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.326 [310]	|■■■■■■■■■■■■
  0.453 [308]	|■■■■■■■■■■■■
  0.580 [134]	|■■■■■
  0.707 [192]	|■■■■■■■■
  0.834 [75]	|■■■
  0.961 [292]	|■■■■■■■■■■■
  1.088 [250]	|■■■■■■■■■■
  1.215 [78]	|■■■
  1.343 [18]	|■


Latency distribution:
  10% in 0.0939 secs
  25% in 0.1271 secs
  50% in 0.3276 secs
  75% in 0.7662 secs
  90% in 0.9939 secs
  95% in 1.0599 secs
  99% in 1.1966 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0714 secs, 1.3426 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.4479 secs, 0.0711 secs, 1.3423 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	2248 responses
  [500]	434 responses



----------------------------------------